v2206/Projects/solverTests/ADTank_lam_newMesh/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 308.15;

boundaryField
{
    allBoundary
    {
        type            zeroGradient;
    }
    
    top
    {
        type            zeroGradient;
    }

    GeoTop
    {
        type            zeroGradient;
    }

    GeoTank
    {
        type            fixedValue;
        value           uniform 308.15;
    }

    GeoShaft
    {
        type            fixedValue;
        value           uniform 308.15;
    }

}


// ************************************************************************* //
