v2206/Projects/solverTests/ADTank_lam_newMesh/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.05;

boundaryField
{
    allBoundary
    {
        type            zeroGradient;
    }

    top
    {
        type            symmetry;
    }

    GeoTop
    {
        type            zeroGradient;
    }

    GeoTank
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    GeoShaft
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    // GeoTank
    // {
    //     type            fixedValue;
    //     value           uniform 1e-16;
    // }

    // GeoShaft
    // {
    //     type            fixedValue;
    //     value           uniform 1e-16;
    // }

}


// ************************************************************************* //
